app/controllers/customers_controller.rb

SELECT * FROM "customers"
---
  def index
    @customers = Customer.all

SELECT * FROM "customers" WHERE ("customers"."id" = 1)
---
  def show
    @customer = Customer.find(params[:id])

SELECT * FROM "customers" WHERE ("customers"."id" = 1)
---
  def edit
    @customer = Customer.find(params[:id])

INSERT INTO "customers" ("name", "address", "created_at", "updated_at", "mobile", "contract", "password", "email") VALUES('aaa', 'addr', '2011-02-04 21:52:44', '2011-02-04 21:52:44', '1233423432432', 'c1', 'aaa', 'aaa@gmail.co')
---
  def create
    @customer = Customer.new(params[:customer])

    respond_to do |format|
      if @customer.save